// Sample questions with answer choices
const questions = [
  {
    question: "(ชื่อผู้เล่น) เป็น “นักเดินทางผู้กล้าหาญ” ที่ตัดสินใจเผชิญหน้ากับกรุงเทพฯ ในวันที่จมอยู่ใต้มหาสมุทร เนื่องจากระดับน้ำทะเลที่เพิ่มสูงขึ้นจากภาวะโลกร้อน ขณะที่ (ชื่อผู้เล่น) กำลังมองหาวิธีเดินทางท่ามกลางเมืองน้ำนี้ ก็พบเข้ากับยานพาหนะ 3 อย่างตรงหน้า (ชื่อผู้เล่น) จะเลือกอะไร ?",
    choices: [
      "เรือไฟฟ้า พลังงานสะอาดที่ไม่มีวันหมด พร้อมพา (ชื่อผู้เล่น) ไปได้ไกลแสนไกล",
      "รถยนต์เก่า ที่ยังใช้ได้ แต่ปล่อยควันดำหนาทึบทุกครั้งที่สตาร์ท",
      "สเก็ตบอร์ด สุดเท่ แต่โชคร้ายถนนกลายเป็นแม่น้ำไปแล้ว",
    ],
    answer: ["เรือไฟฟ้า พลังงานสะอาดที่ไม่มีวันหมด พร้อมพา (ชื่อผู้เล่น) ไปได้ไกลแสนไกล"]
  },
  {
    question: "ทันใดนั้น เมฆดำครึ้มก็พัดผ่านท้องฟ้า ฝนตกกระหน่ำอย่างไม่หยุดยั้ง ฝนนี้ไม่ใช่ธรรมชาติ แต่เป็นผลจากการเปลี่ยนแปลงสภาพภูมิอากาศอย่างรุนแรง (ชื่อผู้เล่น) จะทำยังไงดีเพื่อรอดพ้นจากพายุฝนที่โหมกระหน่ำ ?",
    choices: [
      "หาที่สูง และปลอดภัย รอฝนหยุด",
      "ใช้ถุงพลาสติก มาทำเป็นชุดป้องกันน้ำท่วม แต่รู้สึกแย่หน่อยที่พลาสติกไม่ช่วยสิ่งแวดล้อมเลย",
      "ขุดร่องน้ำ เพื่อช่วยระบายน้ำออกจากพื้นที่ให้ทันก่อนน้ำจะท่วมสูง",
    ],
    answer: ["หาที่สูง และปลอดภัย รอฝนหยุด", "ขุดร่องน้ำ เพื่อช่วยระบายน้ำออกจากพื้นที่ให้ทันก่อนน้ำจะท่วมสูง"]
  },
  {
    question: "(ชื่อผู้เล่น) เดินทางมาถึงเมืองหนึ่งที่ท่านเจ้าเมืองกำลังหารือกันเรื่องการสร้างแหล่งพลังงานใหม่เพื่อรับมือกับการเปลี่ยนแปลงสภาพภูมิอากาศ พวกเขาถามความคิดเห็นว่าควรทำอย่างไร (ชื่อผู้เล่น) จะให้คำแนะนำว่าอย่างไร ?",
    choices: [
      "สร้างโรงไฟฟ้าพลังงานแสงอาทิตย์ เพื่อให้เมืองมีพลังงานสะอาดและไม่ปล่อยก๊าซเรือนกระจก",
      "ใช้พลังงานจากถ่านหิน เพื่อความเร็วและต้นทุนต่ำ แต่ก็ต้องแลกด้วยการปล่อยควันดำ",
      "ใช้พลังงานหมุนเวียน จากลมและน้ำ ที่สามารถใช้งานได้ตลอดไม่ทำลายสิ่งแวดล้อม",
    ],
    answer: ["สร้างโรงไฟฟ้าพลังงานแสงอาทิตย์ เพื่อให้เมืองมีพลังงานสะอาดและไม่ปล่อยก๊าซเรือนกระจก", "ใช้พลังงานหมุนเวียน จากลมและน้ำ ที่สามารถใช้งานได้ตลอดไม่ทำลายสิ่งแวดล้อม"]
  }
];

export default questions;
